ubiubiubi/iwasz-sandbox/trunk/tm4c123-drama-button-v2/src/main.c
static const uint8_t inEndpointDescriptor2[HIDINENDPOINT_SIZE] =
{
    7,                          // The size of the endpoint descriptor.
    USB_DTYPE_ENDPOINT,         // Descriptor type is an endpoint.
    USB_EP_DESC_IN | USBEPToIndex(USB_EP_2),
    USB_EP_ATTR_INT,            // Endpoint is an interrupt endpoint.
    USBShort(USBFIFOSizeToBytes(USB_FIFO_SZ_64)),
                                // The maximum packet size.
    16,                         // The polling interval for this endpoint.
};


/*##########################################################################*/

static const tConfigSection configSection =
{
    sizeof(configurationDescriptor),
    configurationDescriptor
};

static const tConfigSection interfaceSection1 =
{
    sizeof(interfaceDescriptor1),
    interfaceDescriptor1
};

static const tConfigSection hidKeyboardSection1 =
{
    sizeof(hidKeyboardDescriptor1),
    hidKeyboardDescriptor1
};

static const tConfigSection endpointSection1 =
{
    sizeof(inEndpointDescriptor1),
    inEndpointDescriptor1
};

static const tConfigSection interfaceSection2 =
{
    sizeof(interfaceDescriptor2),
    interfaceDescriptor2
};

static const tConfigSection hideKeyboardSection2 =
{
    sizeof(hidKeyboardDescriptor2),
    hidKeyboardDescriptor2
};

static const tConfigSection endpointSection2 =
{
    sizeof(inEndpointDescriptor2),
    inEndpointDescriptor2
};

//*****************************************************************************
//
// This array lists all the sections that must be concatenated to make a
// single, complete HID keyboard configuration descriptor.
//
//*****************************************************************************
const tConfigSection *allConfigSections[] = {
        &configSection,
        &interfaceSection1,
        &hidKeyboardSection1,
        &endpointSection1,
        &interfaceSection2,
        &hideKeyboardSection2,
        &endpointSection2
};

#define NUM_KEYBOARD_SECTIONS (sizeof(allConfigSections) / sizeof(tConfigSection *))

const static tConfigHeader configHeader = {
        NUM_KEYBOARD_SECTIONS,
        allConfigSections
};

const static tConfigHeader *configHeaders[] = { &configHeader };

/****************************************************************************/

/**
 * The languages supported by this device.
 */
const uint8_t g_pui8LangDescriptor[] =
{
    4,
    USB_DTYPE_STRING,
    USBShort(USB_LANG_EN_US)
};

/**
 * The manufacturer string.
 */
const uint8_t g_pui8ManufacturerString[] =
{
    (8 + 1) * 2,
    USB_DTYPE_STRING,
    'I', 0, 'w', 0, 'a', 0, 's', 0, 'z', 0, '.', 0, 'p', 0, 'l', 0
};

/**
 * The product string.
 */
const uint8_t g_pui8ProductString[] =
{
    (12 + 1) * 2,
    USB_DTYPE_STRING,
    'D', 0, 'r', 0, 'a', 0, 'm', 0, 'a', 0, ' ', 0, 'b', 0, 'u', 0,
    't', 0, 't', 0, 'o', 0, 'n'
};

/**
 * The serial number string.
 */
const uint8_t g_pui8SerialNumberString[] =
{
    (2 + 1) * 2,
    USB_DTYPE_STRING,
    '0', 0, '1', 0
};

/**
 * The interface description string.
 */
const uint8_t g_pui8HIDInterfaceString1[] =
{
    (23 + 1) * 2,
    USB_DTYPE_STRING,
    'H', 0, 'I', 0, 'D', 0, ' ', 0, 'K', 0, 'e', 0, 'y', 0, 'b', 0,
    'o', 0, 'a', 0, 'r', 0, 'd', 0, ' ', 0, 'I', 0, 'n', 0, 't', 0, 'e', 0,
    'r', 0, 'f', 0, 'a', 0, 'c', 0, 'e', 0, '1', 0
};

/**
 * The interface description string.
 */
const uint8_t g_pui8HIDInterfaceString2[] =
{
    (23 + 1) * 2,
    USB_DTYPE_STRING,
    'H', 0, 'I', 0, 'D', 0, ' ', 0, 'K', 0, 'e', 0, 'y', 0, 'b', 0,
    'o', 0, 'a', 0, 'r', 0, 'd', 0, ' ', 0, 'I', 0, 'n', 0, 't', 0, 'e', 0,
    'r', 0, 'f', 0, 'a', 0, 'c', 0, 'e', 0, '1', 0
};

/**
 * The configuration description string.
 */
const uint8_t g_pui8ConfigString[] =
{
    (26 + 1) * 2,
    USB_DTYPE_STRING,
    'H', 0, 'I', 0, 'D', 0, ' ', 0, 'K', 0, 'e', 0, 'y', 0, 'b', 0,
    'o', 0, 'a', 0, 'r', 0, 'd', 0, ' ', 0, 'C', 0, 'o', 0, 'n', 0, 'f', 0,
    'i', 0, 'g', 0, 'u', 0, 'r', 0, 'a', 0, 't', 0, 'i', 0, 'o', 0,
    'n', 0
};

/**
 * The descriptor string table. The various string identifiers
 * passed in other descriptors are indexes into the pStringDescriptor array. The first entry of the string
 * descriptor array has a special format and indicates the languages supported by the device.
 */
const uint8_t * const stringDescriptors[] =
{
    g_pui8LangDescriptor,
    g_pui8ManufacturerString,
    g_pui8ProductString,
    g_pui8SerialNumberString,
    g_pui8HIDInterfaceString1,
//    g_pui8HIDInterfaceString2,
    g_pui8ConfigString
};

// -1 because first element is g_pui8LangDescriptor which is not a string.
uint8_t NUM_STRING_DESCRIPTORS = sizeof(stringDescriptors) / sizeof(uint8_t *);

/*##########################################################################*/

static void onGetDescriptor(void *userData, tUSBRequest *psUSBRequest);
static void onRequest(void *userData, tUSBRequest *psUSBRequest);
static void onEndpointsActivity (void *pvHIDInstance, uint32_t ui32Status);
static void onConfigChange (void *pvHIDInstance, uint32_t ui32Info);
static void onDataReceivedEP0 (void *userData, uint32_t ui32Info);

static int32_t scheduleReportTransmission (uint8_t *data, uint16_t len, uint32_t endpoint);

//*****************************************************************************
//
// The device information structure for the USB HID devices.
//
//*****************************************************************************
const tCustomHandlers handlers =
{
    //
    // GetDescriptor
    //
    onGetDescriptor,

    //
    // RequestHandler
    //
    onRequest,

    //
    // InterfaceChange
    //
    0,

    //
    // ConfigChange
    //
    onConfigChange,

    //
    // DataReceived
    //
    onDataReceivedEP0,

    //
    // DataSentCallback
    //
    0/*onEP0DataSent*/,

    //
    // ResetHandler
    //
    0/*onReset*/,

    //
    // SuspendHandler
    //
    0/*onSuspend*/,

    //
    // ResumeHandler
    //
    0/*onResume*/,

    //
    // DisconnectHandler
    //
    0/*onDisconnect*/,

    //
    // EndpointHandler
    //
    onEndpointsActivity,

    //
    // Device handler.
    //
    0/*onDevice*/
};

//*****************************************************************************
//
// This function is called by the USB device stack whenever a request for a
// non-standard descriptor is received.
//
// \param pvHIDInstance is the instance data for this request.
// \param psUSBRequest points to the request received.
//
// This call parses the provided request structure and determines which
// descriptor is being requested.  Assuming the descriptor can be found, it is
// scheduled for transmission via endpoint zero.  If the descriptor cannot be
// found, the endpoint is stalled to indicate an error to the host.
//
//*****************************************************************************
static void onGetDescriptor(void *userData, tUSBRequest *psUSBRequest)
{
    uint32_t ui32Size;
    ASSERT(userData);

    //
    // Which type of class descriptor are we being asked for?
    //
    switch(psUSBRequest->wValue >> 8)
    {
        //
        // This is a request for a HID report or physical descriptor.
        //
        case USB_HID_DTYPE_REPORT:
        {
                if (psUSBRequest->wIndex == 0) {
                        ui32Size = sizeof(reportDescriptor1);

                        // If there is more data to send than the host requested then just send the requested amount of data.
                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }

