ubiubiubi/iwasz-sandbox/trunk/tm4c123-drama-button-v2/src/main.c
        /****************************************************************************/

        CallbackDTO callbackDTO;
        callbackDTO.deviceInfo = &deviceInfo;
        callbackDTO.iHIDTxState1 = eHIDStateUnconfigured;
        callbackDTO.iHIDTxState2 = eHIDStateUnconfigured;

        deviceInfo.psCallbacks = &handlers;
        deviceInfo.pui8DeviceDescriptor = deviceDescriptor;
        deviceInfo.ppsConfigDescriptors = configHeaders;
        deviceInfo.ppui8StringDescriptors = stringDescriptors;
        deviceInfo.ui32NumStringDescriptors = NUM_STRING_DESCRIPTORS;
        USBDCDDeviceInfoInit (0, &deviceInfo);
//        InternalUSBTickInit();

        USBStackModeSet(0, eUSBModeForceDevice, 0);
        USBDCDInit (0, &deviceInfo, &callbackDTO);

        uint8_t ui8ButtonsChanged, ui8Buttons;

        while (1) {
                ButtonsPoll(&ui8ButtonsChanged, &ui8Buttons);

                if (ui8ButtonsChanged) {
                        if(ui8Buttons & LEFT_BUTTON)
                        {
                                printf ("pressed\r\n");
                                callbackDTO.report1[0] = 0x00;
                                callbackDTO.report1[1] = 0x00;
                                callbackDTO.report1[2] = 0x04;

                                callbackDTO.report2[0] = 0x10;
                        }
                        else {
                                printf ("released\r\n");
                                for (int i = 0; i < REPORT1_SIZE; ++i) {
                                        callbackDTO.report1[i] = 0x00;
                                }

                                for (int i = 0; i < REPORT2_SIZE; ++i) {
                                        callbackDTO.report2[i] = 0x00;
                                }
                        }

//                        if (callbackDTO.iHIDTxState1 == eHIDStateIdle) {
//                                reportWrite (&callbackDTO, callbackDTO.report1, REPORT1_SIZE, USB_EP_1);
//                        }

                        if (callbackDTO.iHIDTxState2 == eHIDStateIdle) {
                                reportWrite (&callbackDTO, callbackDTO.report2, REPORT2_SIZE, USB_EP_2);
                        }
                }
        }
}

